In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
df= pd.read_csv('Used_Bikes.csv')
df.head()

,bike_name,price,city,kms_driven,owner,age,power,brand
0,TVS Star City Plus Dual Tone 110cc,35000.0,Ahmedabad,17654.0,First Owner,3.0,110.0,TVS
1,Royal Enfield Classic 350cc,119900.0,Delhi,11000.0,First Owner,4.0,350.0,Royal Enfield
2,Triumph Daytona 675R,600000.0,Delhi,110.0,First Owner,8.0,675.0,Triumph
3,TVS Apache RTR 180cc,65000.0,Bangalore,16329.0,First Owner,4.0,180.0,TVS
4,Yamaha FZ S V 2.0 150cc-Ltd. Edition,80000.0,Bangalore,10000.0,First Owner,3.0,150.0,Yamaha

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32648 entries, 0 to 32647
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   bike_name   32648 non-null  object
 1   price       32648 non-null  float64
 2   city        32648 non-null  object
 3   kms_driven  32648 non-null  float64
 4   owner       32648 non-null  object
 5   age         32648 non-null  float64
 6   power       32648 non-null  float64
 7   brand       32648 non-null  object
dtypes: float64(4), object(4)
memory usage: 2.0+ MB

In [15]:
df.shape

(32648, 8)

In [16]:
df.duplicated().sum()

np.int64(25324)

In [47]:
num_col= df.select_dtypes(exclude='O')
num_col.head()

      price  kms_driven  age  power
0   35000.0     17654.0  3.0  110.0
1  119900.0     11000.0  4.0  350.0
2  600000.0       110.0  8.0  675.0
3   65000.0     16329.0  4.0  180.0
4   80000.0     10000.0  3.0  150.0

In [24]:
cat_col= df.select_dtypes(include='O')
cat_col.head()

                              bike_name       city        owner          brand
0    TVS Star City Plus Dual Tone 110cc  Ahmedabad  First Owner            TVS
1           Royal Enfield Classic 350cc      Delhi  First Owner  Royal Enfield
2                  Triumph Daytona 675R      Delhi  First Owner        Triumph
3                  TVS Apache RTR 180cc  Bangalore  First Owner            TVS
4  Yamaha FZ S V 2.0 150cc-Ltd. Edition  Bangalore  First Owner         Yamaha

In [25]:
#   bike price
# features selections
df.isnull().sum()

bike_name     0
price         0
city          0
kms_driven    0
owner         0
age           0
power         0
brand         0
dtype: int64

In [26]:
cat_col.drop(['bike_name','city'],axis=1,inplace=True)

In [27]:
cat_col.owner.value_counts()

owner
First Owner             29964
Second Owner             2564
Third Owner               108
Fourth Owner Or More       12
Name: count, dtype: int64

In [31]:
dt = {'first owner':1,'second owner':2,'third owner':3,'fourthowner or more':4}
dt

{'first owner': 1,
 'second owner': 2,
 'third owner': 3,
 'fourthowner or more': 4}

In [33]:
cat_col['owner'].map(dt)

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
         ..
32643   NaN
32644   NaN
32645   NaN
32646   NaN
32647   NaN
Name: owner, Length: 32648, dtype: float64

In [34]:
cat_col['owner']=cat_col['owner'].map(dt)

In [37]:
brand_list=list (cat_col['brand'].value_counts().keys())
brand_list

['Bajaj',
 'Hero',
 'Royal Enfield',
 'Yamaha',
 'Honda',
 'Suzuki',
 'TVS',
 'KTM',
 'Harley-Davidson',
 'Kawasaki',
 'Hyosung',
 'Benelli',
 'Mahindra',
 'Triumph',
 'Ducati',
 'BMW',
 'Jawa',
 'MV',
 'Indian',
 'Ideal',
 'Rajdoot',
 'Yezdi',
 'LML']

In [41]:
brand_dict ={}
for values,key in enumerate(brand_list,start=1):
     print(key, ">>>",values)
     brand_dict[key]=values

Bajaj >>> 1
Hero >>> 2
Royal Enfield >>> 3
Yamaha >>> 4
Honda >>> 5
Suzuki >>> 6
TVS >>> 7
KTM >>> 8
Harley-Davidson >>> 9
Kawasaki >>> 10
Hyosung >>> 11
Benelli >>> 12
Mahindra >>> 13
Triumph >>> 14
Ducati >>> 15
BMW >>> 16
Jawa >>> 17
MV >>> 18
Indian >>> 19
Ideal >>> 20
Rajdoot >>> 21
Yezdi >>> 22
LML >>> 23

In [48]:
df2 = pd.concat([cat_col,num_col],axis='columns')
df2.head()

   owner          brand     price  kms_driven  age  power
0    NaN            TVS   35000.0     17654.0  3.0  110.0
1    NaN  Royal Enfield  119900.0     11000.0  4.0  350.0
2    NaN        Triumph  600000.0       110.0  8.0  675.0
3    NaN            TVS   65000.0     16329.0  4.0  180.0
4    NaN         Yamaha   80000.0     10000.0  3.0  150.0

In [43]:
cat_col

       owner          brand
0        NaN            TVS
1        NaN  Royal Enfield
2        NaN        Triumph
3        NaN            TVS
4        NaN         Yamaha
...      ...            ...
32643    NaN           Hero
32644    NaN            TVS
32645    NaN          Bajaj
32646    NaN           Hero
32647    NaN          Bajaj

[32648 rows x 2 columns]

In [49]:
df2

       owner          brand     price  kms_driven   age  power
0        NaN            TVS   35000.0     17654.0   3.0  110.0
1        NaN  Royal Enfield  119900.0     11000.0   4.0  350.0
2        NaN        Triumph  600000.0       110.0   8.0  675.0
3        NaN            TVS   65000.0     16329.0   4.0  180.0
4        NaN         Yamaha   80000.0     10000.0   3.0  150.0
...      ...            ...       ...         ...   ...    ...
32643    NaN           Hero   39000.0     22000.0   4.0  100.0
32644    NaN            TVS   30000.0      6639.0   9.0  180.0
32645    NaN          Bajaj   60000.0     20373.0   6.0  220.0
32646    NaN           Hero   15600.0     84186.0  16.0  125.0
32647    NaN          Bajaj   22000.0     60857.0  13.0  150.0

[32648 rows x 6 columns]

In [51]:
x=df2.drop('price',axis='columns')
y = df2[['price']]

In [52]:
y

          price
0       35000.0
1      119900.0
2      600000.0
3       65000.0
4       80000.0
...         ...
32643   39000.0
32644   30000.0
32645   60000.0
32646   15600.0
32647   22000.0

[32648 rows x 1 columns]

In [ ]:
# training testing spreet

In [54]:
pip install scikit_learn

Requirement already satisfied: scikit_learn in c:\users\i\appdata\local\programs\python\python312\lib\site-packages (1.5.1)
Requirement already satisfied: numpy>=1.19.5 in c:\users\i\appdata\local\programs\python\python312\lib\site-packages (from scikit_learn) (2.0.0)
Requirement already satisfied: scipy>=1.6.0 in c:\users\i\appdata\local\programs\python\python312\lib\site-packages (from scikit_learn) (1.14.0)
Requirement already satisfied: joblib>=1.2.0 in c:\users\i\appdata\local\programs\python\python312\lib\site-packages (from scikit_learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\i\appdata\local\programs\python\python312\lib\site-packages (from scikit_learn) (3.5.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [55]:
from sklearn.model_selection import train_test_split

In [ ]:
train_test_split (x,y,test_size=)